#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.commons.azurerm_app_service_plan.lapp_sp will be created
  + resource "azurerm_app_service_plan" "lapp_sp" {
      + id                           = (known after apply)
      + kind                         = "elastic"
      + location                     = "italynorth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "ts-p-itn-ops-lapp-plan-01"
      + resource_group_name          = "ts-p-itn-ops-rg-01"

      + sku {
          + capacity = (known after apply)
          + size     = "WS1"
          + tier     = "WorkflowStandard"
        }
    }

  # module.commons.azurerm_resource_group.ops_rg will be created
  + resource "azurerm_resource_group" "ops_rg" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "ts-p-itn-ops-rg-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
    }

  # module.commons.azurerm_role_assignment.subs_asyn_staging_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_staging_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/56fb4bda-e165-0cf5-11ca-cb4823971edd" -> (known after apply)
      ~ name                             = "56fb4bda-e165-0cf5-11ca-cb4823971edd" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_role_assignment.subs_asyn_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/ad562a6d-2a15-4570-e728-ce27df69c2a9" -> (known after apply)
      ~ name                             = "ad562a6d-2a15-4570-e728-ce27df69c2a9" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_servicebus_topic.events must be replaced
-/+ resource "azurerm_servicebus_topic" "events" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      - enable_batched_operations               = false -> null
      - enable_express                          = false -> null
      ~ enable_partitioning                     = false -> true # forces replacement
      ~ id                                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
      ~ max_size_in_megabytes                   = 81920 -> (known after apply)
        name                                    = "ts-trial-topic-events"
      - requires_duplicate_detection            = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 3 to destroy.

Warning: Deprecated Resource

  with module.commons.azurerm_app_service_plan.lapp_sp,
  on ../modules/commons/ops.tf line 23, in resource "azurerm_app_service_plan" "lapp_sp":
  23: resource "azurerm_app_service_plan" "lapp_sp" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

Error: name ("ts-p-itnopsstdata01") can only consist of lowercase letters and numbers, and must be between 3 and 24 characters long

  with module.commons.azurerm_storage_account.ops_data,
  on ../modules/commons/ops.tf line 8, in resource "azurerm_storage_account" "ops_data":
   8:   name                     = "${local.project}opsstdata01"


Error: name ("ts-p-itnopsst01") can only consist of lowercase letters and numbers, and must be between 3 and 24 characters long

  with module.commons.azurerm_storage_account.ops,
  on ../modules/commons/ops.tf line 16, in resource "azurerm_storage_account" "ops":
  16:   name                     = "${local.project}opsst01"

::error::Terraform exited with code 1.
```

</details>
